GopalSaraf/Practicals/PSDL/include/proc/pic18lf8390.inc
// Register: SPBRG2
#define SPBRG2 SPBRG2
SPBRG2                                   equ 0F6Fh

// Register: LCDDATA11
#define LCDDATA11 LCDDATA11
LCDDATA11                                equ 0F70h
// bitfield definitions
LCDDATA11_LCDDATA11_POSN                 equ 0000h
LCDDATA11_LCDDATA11_POSITION             equ 0000h
LCDDATA11_LCDDATA11_SIZE                 equ 0008h
LCDDATA11_LCDDATA11_LENGTH               equ 0008h
LCDDATA11_LCDDATA11_MASK                 equ 00FFh
LCDDATA11_S40C1_POSN                     equ 0000h
LCDDATA11_S40C1_POSITION                 equ 0000h
LCDDATA11_S40C1_SIZE                     equ 0001h
LCDDATA11_S40C1_LENGTH                   equ 0001h
LCDDATA11_S40C1_MASK                     equ 0001h
LCDDATA11_S41C1_POSN                     equ 0001h
LCDDATA11_S41C1_POSITION                 equ 0001h
LCDDATA11_S41C1_SIZE                     equ 0001h
LCDDATA11_S41C1_LENGTH                   equ 0001h
LCDDATA11_S41C1_MASK                     equ 0002h
LCDDATA11_S42C1_POSN                     equ 0002h
LCDDATA11_S42C1_POSITION                 equ 0002h
LCDDATA11_S42C1_SIZE                     equ 0001h
LCDDATA11_S42C1_LENGTH                   equ 0001h
LCDDATA11_S42C1_MASK                     equ 0004h
LCDDATA11_S43C1_POSN                     equ 0003h
LCDDATA11_S43C1_POSITION                 equ 0003h
LCDDATA11_S43C1_SIZE                     equ 0001h
LCDDATA11_S43C1_LENGTH                   equ 0001h
LCDDATA11_S43C1_MASK                     equ 0008h
LCDDATA11_S44C1_POSN                     equ 0004h
LCDDATA11_S44C1_POSITION                 equ 0004h
LCDDATA11_S44C1_SIZE                     equ 0001h
LCDDATA11_S44C1_LENGTH                   equ 0001h
LCDDATA11_S44C1_MASK                     equ 0010h
LCDDATA11_S45C1_POSN                     equ 0005h
LCDDATA11_S45C1_POSITION                 equ 0005h
LCDDATA11_S45C1_SIZE                     equ 0001h
LCDDATA11_S45C1_LENGTH                   equ 0001h
LCDDATA11_S45C1_MASK                     equ 0020h
LCDDATA11_S46C1_POSN                     equ 0006h
LCDDATA11_S46C1_POSITION                 equ 0006h
LCDDATA11_S46C1_SIZE                     equ 0001h
LCDDATA11_S46C1_LENGTH                   equ 0001h
LCDDATA11_S46C1_MASK                     equ 0040h
LCDDATA11_S47C1_POSN                     equ 0007h
LCDDATA11_S47C1_POSITION                 equ 0007h
LCDDATA11_S47C1_SIZE                     equ 0001h
LCDDATA11_S47C1_LENGTH                   equ 0001h
LCDDATA11_S47C1_MASK                     equ 0080h
LCDDATA11_SEG40COM1_POSN                 equ 0000h
LCDDATA11_SEG40COM1_POSITION             equ 0000h
LCDDATA11_SEG40COM1_SIZE                 equ 0001h
LCDDATA11_SEG40COM1_LENGTH               equ 0001h
LCDDATA11_SEG40COM1_MASK                 equ 0001h
LCDDATA11_SEG41COM1_POSN                 equ 0001h
LCDDATA11_SEG41COM1_POSITION             equ 0001h
LCDDATA11_SEG41COM1_SIZE                 equ 0001h
LCDDATA11_SEG41COM1_LENGTH               equ 0001h
LCDDATA11_SEG41COM1_MASK                 equ 0002h
LCDDATA11_SEG42COM1_POSN                 equ 0002h
LCDDATA11_SEG42COM1_POSITION             equ 0002h
LCDDATA11_SEG42COM1_SIZE                 equ 0001h
LCDDATA11_SEG42COM1_LENGTH               equ 0001h
LCDDATA11_SEG42COM1_MASK                 equ 0004h
LCDDATA11_SEG43COM1_POSN                 equ 0003h
LCDDATA11_SEG43COM1_POSITION             equ 0003h
LCDDATA11_SEG43COM1_SIZE                 equ 0001h
LCDDATA11_SEG43COM1_LENGTH               equ 0001h
LCDDATA11_SEG43COM1_MASK                 equ 0008h
LCDDATA11_SEG44COM1_POSN                 equ 0004h
LCDDATA11_SEG44COM1_POSITION             equ 0004h
LCDDATA11_SEG44COM1_SIZE                 equ 0001h
LCDDATA11_SEG44COM1_LENGTH               equ 0001h
LCDDATA11_SEG44COM1_MASK                 equ 0010h
LCDDATA11_SEG45COM1_POSN                 equ 0005h
LCDDATA11_SEG45COM1_POSITION             equ 0005h
LCDDATA11_SEG45COM1_SIZE                 equ 0001h
LCDDATA11_SEG45COM1_LENGTH               equ 0001h
LCDDATA11_SEG45COM1_MASK                 equ 0020h
LCDDATA11_SEG46COM1_POSN                 equ 0006h
LCDDATA11_SEG46COM1_POSITION             equ 0006h
LCDDATA11_SEG46COM1_SIZE                 equ 0001h
LCDDATA11_SEG46COM1_LENGTH               equ 0001h
LCDDATA11_SEG46COM1_MASK                 equ 0040h
LCDDATA11_SEG47COM1_POSN                 equ 0007h
LCDDATA11_SEG47COM1_POSITION             equ 0007h
LCDDATA11_SEG47COM1_SIZE                 equ 0001h
LCDDATA11_SEG47COM1_LENGTH               equ 0001h
LCDDATA11_SEG47COM1_MASK                 equ 0080h
LCDDATA11_ADMSK1_POSN                    equ 0001h
LCDDATA11_ADMSK1_POSITION                equ 0001h
LCDDATA11_ADMSK1_SIZE                    equ 0001h
LCDDATA11_ADMSK1_LENGTH                  equ 0001h
LCDDATA11_ADMSK1_MASK                    equ 0002h
LCDDATA11_ADMSK2_POSN                    equ 0002h
LCDDATA11_ADMSK2_POSITION                equ 0002h
LCDDATA11_ADMSK2_SIZE                    equ 0001h
LCDDATA11_ADMSK2_LENGTH                  equ 0001h
LCDDATA11_ADMSK2_MASK                    equ 0004h
LCDDATA11_ADMSK3_POSN                    equ 0003h
LCDDATA11_ADMSK3_POSITION                equ 0003h
LCDDATA11_ADMSK3_SIZE                    equ 0001h
LCDDATA11_ADMSK3_LENGTH                  equ 0001h
LCDDATA11_ADMSK3_MASK                    equ 0008h
LCDDATA11_ADMSK4_POSN                    equ 0004h
LCDDATA11_ADMSK4_POSITION                equ 0004h
LCDDATA11_ADMSK4_SIZE                    equ 0001h
LCDDATA11_ADMSK4_LENGTH                  equ 0001h
LCDDATA11_ADMSK4_MASK                    equ 0010h
LCDDATA11_ADMSK5_POSN                    equ 0005h
LCDDATA11_ADMSK5_POSITION                equ 0005h
LCDDATA11_ADMSK5_SIZE                    equ 0001h
LCDDATA11_ADMSK5_LENGTH                  equ 0001h
LCDDATA11_ADMSK5_MASK                    equ 0020h

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
LCDDATA12                                equ 0F71h
// bitfield definitions
LCDDATA12_LCDDATA12_POSN                 equ 0000h
LCDDATA12_LCDDATA12_POSITION             equ 0000h
LCDDATA12_LCDDATA12_SIZE                 equ 0008h
LCDDATA12_LCDDATA12_LENGTH               equ 0008h
LCDDATA12_LCDDATA12_MASK                 equ 00FFh
LCDDATA12_S0C2_POSN                      equ 0000h
LCDDATA12_S0C2_POSITION                  equ 0000h
LCDDATA12_S0C2_SIZE                      equ 0001h
LCDDATA12_S0C2_LENGTH                    equ 0001h
LCDDATA12_S0C2_MASK                      equ 0001h
LCDDATA12_S1C2_POSN                      equ 0001h
LCDDATA12_S1C2_POSITION                  equ 0001h
LCDDATA12_S1C2_SIZE                      equ 0001h
LCDDATA12_S1C2_LENGTH                    equ 0001h
LCDDATA12_S1C2_MASK                      equ 0002h
LCDDATA12_S2C2_POSN                      equ 0002h
LCDDATA12_S2C2_POSITION                  equ 0002h
LCDDATA12_S2C2_SIZE                      equ 0001h
LCDDATA12_S2C2_LENGTH                    equ 0001h
LCDDATA12_S2C2_MASK                      equ 0004h
LCDDATA12_S3C2_POSN                      equ 0003h
LCDDATA12_S3C2_POSITION                  equ 0003h
LCDDATA12_S3C2_SIZE                      equ 0001h
LCDDATA12_S3C2_LENGTH                    equ 0001h
LCDDATA12_S3C2_MASK                      equ 0008h
LCDDATA12_S4C2_POSN                      equ 0004h
LCDDATA12_S4C2_POSITION                  equ 0004h
LCDDATA12_S4C2_SIZE                      equ 0001h
LCDDATA12_S4C2_LENGTH                    equ 0001h
LCDDATA12_S4C2_MASK                      equ 0010h
LCDDATA12_S5C2_POSN                      equ 0005h
LCDDATA12_S5C2_POSITION                  equ 0005h
LCDDATA12_S5C2_SIZE                      equ 0001h
LCDDATA12_S5C2_LENGTH                    equ 0001h
LCDDATA12_S5C2_MASK                      equ 0020h
LCDDATA12_S6C2_POSN                      equ 0006h
LCDDATA12_S6C2_POSITION                  equ 0006h
LCDDATA12_S6C2_SIZE                      equ 0001h
LCDDATA12_S6C2_LENGTH                    equ 0001h
LCDDATA12_S6C2_MASK                      equ 0040h
LCDDATA12_S7C2_POSN                      equ 0007h
LCDDATA12_S7C2_POSITION                  equ 0007h
LCDDATA12_S7C2_SIZE                      equ 0001h
LCDDATA12_S7C2_LENGTH                    equ 0001h
LCDDATA12_S7C2_MASK                      equ 0080h
LCDDATA12_SEG0COM2_POSN                  equ 0000h
LCDDATA12_SEG0COM2_POSITION              equ 0000h
LCDDATA12_SEG0COM2_SIZE                  equ 0001h
LCDDATA12_SEG0COM2_LENGTH                equ 0001h
LCDDATA12_SEG0COM2_MASK                  equ 0001h
LCDDATA12_SEG1COM2_POSN                  equ 0001h
LCDDATA12_SEG1COM2_POSITION              equ 0001h
LCDDATA12_SEG1COM2_SIZE                  equ 0001h
LCDDATA12_SEG1COM2_LENGTH                equ 0001h
LCDDATA12_SEG1COM2_MASK                  equ 0002h
LCDDATA12_SEG2COM2_POSN                  equ 0002h
LCDDATA12_SEG2COM2_POSITION              equ 0002h
LCDDATA12_SEG2COM2_SIZE                  equ 0001h
LCDDATA12_SEG2COM2_LENGTH                equ 0001h
LCDDATA12_SEG2COM2_MASK                  equ 0004h
LCDDATA12_SEG3COM2_POSN                  equ 0003h
LCDDATA12_SEG3COM2_POSITION              equ 0003h
LCDDATA12_SEG3COM2_SIZE                  equ 0001h
LCDDATA12_SEG3COM2_LENGTH                equ 0001h
LCDDATA12_SEG3COM2_MASK                  equ 0008h
LCDDATA12_SEG4COM2_POSN                  equ 0004h
LCDDATA12_SEG4COM2_POSITION              equ 0004h
LCDDATA12_SEG4COM2_SIZE                  equ 0001h
LCDDATA12_SEG4COM2_LENGTH                equ 0001h
LCDDATA12_SEG4COM2_MASK                  equ 0010h
LCDDATA12_SEG5COM2_POSN                  equ 0005h
LCDDATA12_SEG5COM2_POSITION              equ 0005h
LCDDATA12_SEG5COM2_SIZE                  equ 0001h
LCDDATA12_SEG5COM2_LENGTH                equ 0001h
LCDDATA12_SEG5COM2_MASK                  equ 0020h
LCDDATA12_SEG6COM2_POSN                  equ 0006h
LCDDATA12_SEG6COM2_POSITION              equ 0006h
LCDDATA12_SEG6COM2_SIZE                  equ 0001h
LCDDATA12_SEG6COM2_LENGTH                equ 0001h
LCDDATA12_SEG6COM2_MASK                  equ 0040h
LCDDATA12_SEG7COM2_POSN                  equ 0007h
LCDDATA12_SEG7COM2_POSITION              equ 0007h
LCDDATA12_SEG7COM2_SIZE                  equ 0001h
LCDDATA12_SEG7COM2_LENGTH                equ 0001h
LCDDATA12_SEG7COM2_MASK                  equ 0080h
LCDDATA12_S00C2_POSN                     equ 0000h
LCDDATA12_S00C2_POSITION                 equ 0000h
LCDDATA12_S00C2_SIZE                     equ 0001h
LCDDATA12_S00C2_LENGTH                   equ 0001h
LCDDATA12_S00C2_MASK                     equ 0001h
LCDDATA12_S01C2_POSN                     equ 0001h
LCDDATA12_S01C2_POSITION                 equ 0001h
LCDDATA12_S01C2_SIZE                     equ 0001h
LCDDATA12_S01C2_LENGTH                   equ 0001h
LCDDATA12_S01C2_MASK                     equ 0002h
LCDDATA12_S02C2_POSN                     equ 0002h
LCDDATA12_S02C2_POSITION                 equ 0002h
LCDDATA12_S02C2_SIZE                     equ 0001h
LCDDATA12_S02C2_LENGTH                   equ 0001h
LCDDATA12_S02C2_MASK                     equ 0004h
LCDDATA12_S03C2_POSN                     equ 0003h
LCDDATA12_S03C2_POSITION                 equ 0003h
LCDDATA12_S03C2_SIZE                     equ 0001h
LCDDATA12_S03C2_LENGTH                   equ 0001h
LCDDATA12_S03C2_MASK                     equ 0008h
LCDDATA12_S04C2_POSN                     equ 0004h
LCDDATA12_S04C2_POSITION                 equ 0004h
LCDDATA12_S04C2_SIZE                     equ 0001h
LCDDATA12_S04C2_LENGTH                   equ 0001h
LCDDATA12_S04C2_MASK                     equ 0010h
LCDDATA12_S05C2_POSN                     equ 0005h
LCDDATA12_S05C2_POSITION                 equ 0005h
LCDDATA12_S05C2_SIZE                     equ 0001h
LCDDATA12_S05C2_LENGTH                   equ 0001h
LCDDATA12_S05C2_MASK                     equ 0020h
LCDDATA12_S06C2_POSN                     equ 0006h
LCDDATA12_S06C2_POSITION                 equ 0006h
LCDDATA12_S06C2_SIZE                     equ 0001h
LCDDATA12_S06C2_LENGTH                   equ 0001h
LCDDATA12_S06C2_MASK                     equ 0040h
LCDDATA12_S07C2_POSN                     equ 0007h
LCDDATA12_S07C2_POSITION                 equ 0007h
LCDDATA12_S07C2_SIZE                     equ 0001h
LCDDATA12_S07C2_LENGTH                   equ 0001h
LCDDATA12_S07C2_MASK                     equ 0080h
LCDDATA12_SSPM012_POSN                   equ 0000h
LCDDATA12_SSPM012_POSITION               equ 0000h
LCDDATA12_SSPM012_SIZE                   equ 0001h
LCDDATA12_SSPM012_LENGTH                 equ 0001h
LCDDATA12_SSPM012_MASK                   equ 0001h
LCDDATA12_SSPM112_POSN                   equ 0001h
LCDDATA12_SSPM112_POSITION               equ 0001h
LCDDATA12_SSPM112_SIZE                   equ 0001h
LCDDATA12_SSPM112_LENGTH                 equ 0001h
LCDDATA12_SSPM112_MASK                   equ 0002h
LCDDATA12_SSPM212_POSN                   equ 0002h
LCDDATA12_SSPM212_POSITION               equ 0002h
LCDDATA12_SSPM212_SIZE                   equ 0001h
LCDDATA12_SSPM212_LENGTH                 equ 0001h
LCDDATA12_SSPM212_MASK                   equ 0004h
LCDDATA12_SSPM312_POSN                   equ 0003h
LCDDATA12_SSPM312_POSITION               equ 0003h
LCDDATA12_SSPM312_SIZE                   equ 0001h
LCDDATA12_SSPM312_LENGTH                 equ 0001h
LCDDATA12_SSPM312_MASK                   equ 0008h

// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
LCDDATA13                                equ 0F72h
// bitfield definitions
LCDDATA13_LCDDATA13_POSN                 equ 0000h
LCDDATA13_LCDDATA13_POSITION             equ 0000h
LCDDATA13_LCDDATA13_SIZE                 equ 0008h
LCDDATA13_LCDDATA13_LENGTH               equ 0008h
LCDDATA13_LCDDATA13_MASK                 equ 00FFh
LCDDATA13_S8C2_POSN                      equ 0000h
LCDDATA13_S8C2_POSITION                  equ 0000h
LCDDATA13_S8C2_SIZE                      equ 0001h
LCDDATA13_S8C2_LENGTH                    equ 0001h
LCDDATA13_S8C2_MASK                      equ 0001h
LCDDATA13_S9C2_POSN                      equ 0001h
LCDDATA13_S9C2_POSITION                  equ 0001h
LCDDATA13_S9C2_SIZE                      equ 0001h
LCDDATA13_S9C2_LENGTH                    equ 0001h
LCDDATA13_S9C2_MASK                      equ 0002h
LCDDATA13_S10C2_POSN                     equ 0002h
LCDDATA13_S10C2_POSITION                 equ 0002h
LCDDATA13_S10C2_SIZE                     equ 0001h
LCDDATA13_S10C2_LENGTH                   equ 0001h
LCDDATA13_S10C2_MASK                     equ 0004h
LCDDATA13_S11C2_POSN                     equ 0003h
LCDDATA13_S11C2_POSITION                 equ 0003h
LCDDATA13_S11C2_SIZE                     equ 0001h
LCDDATA13_S11C2_LENGTH                   equ 0001h
LCDDATA13_S11C2_MASK                     equ 0008h
LCDDATA13_S12C2_POSN                     equ 0004h
LCDDATA13_S12C2_POSITION                 equ 0004h
LCDDATA13_S12C2_SIZE                     equ 0001h
LCDDATA13_S12C2_LENGTH                   equ 0001h
LCDDATA13_S12C2_MASK                     equ 0010h
LCDDATA13_S13C2_POSN                     equ 0005h
LCDDATA13_S13C2_POSITION                 equ 0005h
LCDDATA13_S13C2_SIZE                     equ 0001h
LCDDATA13_S13C2_LENGTH                   equ 0001h
LCDDATA13_S13C2_MASK                     equ 0020h
LCDDATA13_S14C2_POSN                     equ 0006h
LCDDATA13_S14C2_POSITION                 equ 0006h
LCDDATA13_S14C2_SIZE                     equ 0001h
LCDDATA13_S14C2_LENGTH                   equ 0001h
LCDDATA13_S14C2_MASK                     equ 0040h
LCDDATA13_S15C2_POSN                     equ 0007h
LCDDATA13_S15C2_POSITION                 equ 0007h
LCDDATA13_S15C2_SIZE                     equ 0001h
LCDDATA13_S15C2_LENGTH                   equ 0001h
LCDDATA13_S15C2_MASK                     equ 0080h
LCDDATA13_SEG8COM2_POSN                  equ 0000h
LCDDATA13_SEG8COM2_POSITION              equ 0000h
LCDDATA13_SEG8COM2_SIZE                  equ 0001h
LCDDATA13_SEG8COM2_LENGTH                equ 0001h
LCDDATA13_SEG8COM2_MASK                  equ 0001h
LCDDATA13_SEG9COM2_POSN                  equ 0001h
LCDDATA13_SEG9COM2_POSITION              equ 0001h
LCDDATA13_SEG9COM2_SIZE                  equ 0001h
LCDDATA13_SEG9COM2_LENGTH                equ 0001h
LCDDATA13_SEG9COM2_MASK                  equ 0002h
LCDDATA13_SEG10COM2_POSN                 equ 0002h
LCDDATA13_SEG10COM2_POSITION             equ 0002h
LCDDATA13_SEG10COM2_SIZE                 equ 0001h
LCDDATA13_SEG10COM2_LENGTH               equ 0001h
LCDDATA13_SEG10COM2_MASK                 equ 0004h
LCDDATA13_SEG11COM2_POSN                 equ 0003h
LCDDATA13_SEG11COM2_POSITION             equ 0003h
LCDDATA13_SEG11COM2_SIZE                 equ 0001h
LCDDATA13_SEG11COM2_LENGTH               equ 0001h
LCDDATA13_SEG11COM2_MASK                 equ 0008h
LCDDATA13_SEG12COM2_POSN                 equ 0004h
LCDDATA13_SEG12COM2_POSITION             equ 0004h
LCDDATA13_SEG12COM2_SIZE                 equ 0001h
LCDDATA13_SEG12COM2_LENGTH               equ 0001h
LCDDATA13_SEG12COM2_MASK                 equ 0010h
LCDDATA13_SEG13COM2_POSN                 equ 0005h
LCDDATA13_SEG13COM2_POSITION             equ 0005h
LCDDATA13_SEG13COM2_SIZE                 equ 0001h
LCDDATA13_SEG13COM2_LENGTH               equ 0001h
LCDDATA13_SEG13COM2_MASK                 equ 0020h
LCDDATA13_SEG14COM2_POSN                 equ 0006h
LCDDATA13_SEG14COM2_POSITION             equ 0006h
LCDDATA13_SEG14COM2_SIZE                 equ 0001h
LCDDATA13_SEG14COM2_LENGTH               equ 0001h
LCDDATA13_SEG14COM2_MASK                 equ 0040h
LCDDATA13_SEG15COM2_POSN                 equ 0007h
LCDDATA13_SEG15COM2_POSITION             equ 0007h
LCDDATA13_SEG15COM2_SIZE                 equ 0001h
LCDDATA13_SEG15COM2_LENGTH               equ 0001h
LCDDATA13_SEG15COM2_MASK                 equ 0080h
LCDDATA13_S08C2_POSN                     equ 0000h
LCDDATA13_S08C2_POSITION                 equ 0000h
LCDDATA13_S08C2_SIZE                     equ 0001h
LCDDATA13_S08C2_LENGTH                   equ 0001h
LCDDATA13_S08C2_MASK                     equ 0001h
LCDDATA13_S09C2_POSN                     equ 0001h
LCDDATA13_S09C2_POSITION                 equ 0001h
LCDDATA13_S09C2_SIZE                     equ 0001h
LCDDATA13_S09C2_LENGTH                   equ 0001h
LCDDATA13_S09C2_MASK                     equ 0002h

